testsuite/sysbench/results/oltp_point_select.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 103458.04 qps: 103458.04 (r/w/o: 103458.04/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 104177.60 qps: 104177.60 (r/w/o: 104177.60/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 104197.89 qps: 104197.89 (r/w/o: 104197.89/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6251238
        write:                           0
        other:                           0
        total:                           6251238
    transactions:                        6251238 (104162.04 per sec.)
    queries:                             6251238 (104162.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      104162.0357
    time elapsed:                        60.0147s
    total number of events:              6251238

Latency (ms):
         min:                                    0.14
         avg:                                    1.23
         max:                                   73.77
         95th percentile:                        0.17
         sum:                              7678888.14

Threads fairness:
    events (avg/stddev):           48836.1562/1054.90
    execution time (avg/stddev):   59.9913/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 110641.66 qps: 110641.66 (r/w/o: 110641.66/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 111088.18 qps: 111088.18 (r/w/o: 111088.18/0.00/0.00) lat (ms,95%): 0.15 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 111014.33 qps: 111014.33 (r/w/o: 111014.33/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6662858
        write:                           0
        other:                           0
        total:                           6662858
    transactions:                        6662858 (111023.02 per sec.)
    queries:                             6662858 (111023.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      111023.0179
    time elapsed:                        60.0135s
    total number of events:              6662858

Latency (ms):
         min:                                    0.13
         avg:                                    1.15
         max:                                   85.20
         95th percentile:                        0.16
         sum:                              7678886.05

Threads fairness:
    events (avg/stddev):           52051.8359/2315.41
    execution time (avg/stddev):   59.9913/0.02